'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''

my_list = [1, 2, 3, 4, 5]

my_list.reverse()
print("Метод reverse:", my_list)
#reversed_list = my_list[::-1]
#print("Срез:", reversed_list)